Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxLmu_bf.h
/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN58 */
#define IFX_LMU_ACCEN1_EN58_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN58 */
#define IFX_LMU_ACCEN1_EN58_OFF (26u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN59 */
#define IFX_LMU_ACCEN1_EN59_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN59 */
#define IFX_LMU_ACCEN1_EN59_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN59 */
#define IFX_LMU_ACCEN1_EN59_OFF (27u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN60 */
#define IFX_LMU_ACCEN1_EN60_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN60 */
#define IFX_LMU_ACCEN1_EN60_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN60 */
#define IFX_LMU_ACCEN1_EN60_OFF (28u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN61 */
#define IFX_LMU_ACCEN1_EN61_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN61 */
#define IFX_LMU_ACCEN1_EN61_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN61 */
#define IFX_LMU_ACCEN1_EN61_OFF (29u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN62 */
#define IFX_LMU_ACCEN1_EN62_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN62 */
#define IFX_LMU_ACCEN1_EN62_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN62 */
#define IFX_LMU_ACCEN1_EN62_OFF (30u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN63 */
#define IFX_LMU_ACCEN1_EN63_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN63 */
#define IFX_LMU_ACCEN1_EN63_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN63 */
#define IFX_LMU_ACCEN1_EN63_OFF (31u)

/** \brief Length for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_LEN (1u)

/** \brief Mask for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_MSK (0x1u)

/** \brief Offset for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_OFF (2u)

/** \brief Length for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_LEN (1u)

/** \brief Mask for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_MSK (0x1u)

/** \brief Offset for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_OFF (4u)

/** \brief Length for Ifx_LMU_MEMCON_Bits.DATAERR */
#define IFX_LMU_MEMCON_DATAERR_LEN (1u)

/** \brief Mask for Ifx_LMU_MEMCON_Bits.DATAERR */
#define IFX_LMU_MEMCON_DATAERR_MSK (0x1u)

/** \brief Offset for Ifx_LMU_MEMCON_Bits.DATAERR */
#define IFX_LMU_MEMCON_DATAERR_OFF (6u)

/** \brief Length for Ifx_LMU_MEMCON_Bits.ADDERR */
#define IFX_LMU_MEMCON_ADDERR_LEN (1u)

/** \brief Mask for Ifx_LMU_MEMCON_Bits.ADDERR */
#define IFX_LMU_MEMCON_ADDERR_MSK (0x1u)

/** \brief Offset for Ifx_LMU_MEMCON_Bits.ADDERR */
#define IFX_LMU_MEMCON_ADDERR_OFF (7u)

/** \brief Length for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_LEN (1u)

/** \brief Mask for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_MSK (0x1u)

/** \brief Offset for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_OFF (8u)

/** \brief Length for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_LEN (1u)

/** \brief Mask for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_MSK (0x1u)

/** \brief Offset for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_OFF (9u)

/** \brief Length for Ifx_LMU_SCTRL_Bits.GED */
#define IFX_LMU_SCTRL_GED_LEN (1u)

/** \brief Mask for Ifx_LMU_SCTRL_Bits.GED */
#define IFX_LMU_SCTRL_GED_MSK (0x1u)

/** \brief Offset for Ifx_LMU_SCTRL_Bits.GED */
#define IFX_LMU_SCTRL_GED_OFF (0u)

/** \brief Length for Ifx_LMU_SCTRL_Bits.GEC */
#define IFX_LMU_SCTRL_GEC_LEN (1u)

/** \brief Mask for Ifx_LMU_SCTRL_Bits.GEC */
#define IFX_LMU_SCTRL_GEC_MSK (0x1u)

/** \brief Offset for Ifx_LMU_SCTRL_Bits.GEC */
#define IFX_LMU_SCTRL_GEC_OFF (1u)

/** \brief Length for Ifx_LMU_SCTRL_Bits.LSEN */
#define IFX_LMU_SCTRL_LSEN_LEN (2u)

/** \brief Mask for Ifx_LMU_SCTRL_Bits.LSEN */
#define IFX_LMU_SCTRL_LSEN_MSK (0x3u)

/** \brief Offset for Ifx_LMU_SCTRL_Bits.LSEN */
#define IFX_LMU_SCTRL_LSEN_OFF (8u)

/** \brief Length for Ifx_LMU_SCTRL_Bits.LSTST */
#define IFX_LMU_SCTRL_LSTST_LEN (2u)

/** \brief Mask for Ifx_LMU_SCTRL_Bits.LSTST */
#define IFX_LMU_SCTRL_LSTST_MSK (0x3u)

/** \brief Offset for Ifx_LMU_SCTRL_Bits.LSTST */
#define IFX_LMU_SCTRL_LSTST_OFF (10u)

/** \brief Length for Ifx_LMU_SCTRL_Bits.LSSTAT */
#define IFX_LMU_SCTRL_LSSTAT_LEN (2u)

/** \brief Mask for Ifx_LMU_SCTRL_Bits.LSSTAT */
#define IFX_LMU_SCTRL_LSSTAT_MSK (0x3u)

/** \brief Offset for Ifx_LMU_SCTRL_Bits.LSSTAT */
#define IFX_LMU_SCTRL_LSSTAT_OFF (16u)

/** \brief Length for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_LEN (27u)

/** \brief Mask for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_OFF (5u)

/** \brief Length for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_LEN (27u)

/** \brief Mask for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_OFF (5u)

/** \brief Length for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_LEN (1u)

/** \brief Mask for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_OFF (0u)

/** \brief Length for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_LEN (1u)

/** \brief Mask for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_OFF (1u)

/** \brief Length for Ifx_LMU_RGN_ACCENA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENA_EN2_LEN (1u)

/** \brief Mask for Ifx_LMU_RGN_ACCENA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGN_ACCENA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENA_EN2_OFF (2u)

/** \brief Length for Ifx_LMU_RGN_ACCENA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENA_EN3_LEN (1u)

/** \brief Mask for Ifx_LMU_RGN_ACCENA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGN_ACCENA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENA_EN3_OFF (3u)

/** \brief Length for Ifx_LMU_RGN_ACCENA_Bits.EN4 */
#define IFX_LMU_RGN_ACCENA_EN4_LEN (1u)

