Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxLmu_bf.h
/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN6 */
#define IFX_LMU_RGNACCEN_RA_EN6_OFF (6u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN7 */
#define IFX_LMU_RGNACCEN_RA_EN7_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN7 */
#define IFX_LMU_RGNACCEN_RA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN7 */
#define IFX_LMU_RGNACCEN_RA_EN7_OFF (7u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN8 */
#define IFX_LMU_RGNACCEN_RA_EN8_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN8 */
#define IFX_LMU_RGNACCEN_RA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN8 */
#define IFX_LMU_RGNACCEN_RA_EN8_OFF (8u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN9 */
#define IFX_LMU_RGNACCEN_RA_EN9_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN9 */
#define IFX_LMU_RGNACCEN_RA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN9 */
#define IFX_LMU_RGNACCEN_RA_EN9_OFF (9u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN10 */
#define IFX_LMU_RGNACCEN_RA_EN10_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN10 */
#define IFX_LMU_RGNACCEN_RA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN10 */
#define IFX_LMU_RGNACCEN_RA_EN10_OFF (10u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN11 */
#define IFX_LMU_RGNACCEN_RA_EN11_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN11 */
#define IFX_LMU_RGNACCEN_RA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN11 */
#define IFX_LMU_RGNACCEN_RA_EN11_OFF (11u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN12 */
#define IFX_LMU_RGNACCEN_RA_EN12_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN12 */
#define IFX_LMU_RGNACCEN_RA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN12 */
#define IFX_LMU_RGNACCEN_RA_EN12_OFF (12u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN13 */
#define IFX_LMU_RGNACCEN_RA_EN13_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN13 */
#define IFX_LMU_RGNACCEN_RA_EN13_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN13 */
#define IFX_LMU_RGNACCEN_RA_EN13_OFF (13u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN14 */
#define IFX_LMU_RGNACCEN_RA_EN14_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN14 */
#define IFX_LMU_RGNACCEN_RA_EN14_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN14 */
#define IFX_LMU_RGNACCEN_RA_EN14_OFF (14u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN15 */
#define IFX_LMU_RGNACCEN_RA_EN15_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN15 */
#define IFX_LMU_RGNACCEN_RA_EN15_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN15 */
#define IFX_LMU_RGNACCEN_RA_EN15_OFF (15u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN16 */
#define IFX_LMU_RGNACCEN_RA_EN16_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN16 */
#define IFX_LMU_RGNACCEN_RA_EN16_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN16 */
#define IFX_LMU_RGNACCEN_RA_EN16_OFF (16u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN17 */
#define IFX_LMU_RGNACCEN_RA_EN17_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN17 */
#define IFX_LMU_RGNACCEN_RA_EN17_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN17 */
#define IFX_LMU_RGNACCEN_RA_EN17_OFF (17u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN18 */
#define IFX_LMU_RGNACCEN_RA_EN18_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN18 */
#define IFX_LMU_RGNACCEN_RA_EN18_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN18 */
#define IFX_LMU_RGNACCEN_RA_EN18_OFF (18u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN19 */
#define IFX_LMU_RGNACCEN_RA_EN19_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN19 */
#define IFX_LMU_RGNACCEN_RA_EN19_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN19 */
#define IFX_LMU_RGNACCEN_RA_EN19_OFF (19u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN20 */
#define IFX_LMU_RGNACCEN_RA_EN20_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN20 */
#define IFX_LMU_RGNACCEN_RA_EN20_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN20 */
#define IFX_LMU_RGNACCEN_RA_EN20_OFF (20u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN21 */
#define IFX_LMU_RGNACCEN_RA_EN21_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN21 */
#define IFX_LMU_RGNACCEN_RA_EN21_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN21 */
#define IFX_LMU_RGNACCEN_RA_EN21_OFF (21u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN22 */
#define IFX_LMU_RGNACCEN_RA_EN22_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN22 */
#define IFX_LMU_RGNACCEN_RA_EN22_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN22 */
#define IFX_LMU_RGNACCEN_RA_EN22_OFF (22u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN23 */
#define IFX_LMU_RGNACCEN_RA_EN23_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN23 */
#define IFX_LMU_RGNACCEN_RA_EN23_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN23 */
#define IFX_LMU_RGNACCEN_RA_EN23_OFF (23u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN24 */
#define IFX_LMU_RGNACCEN_RA_EN24_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN24 */
#define IFX_LMU_RGNACCEN_RA_EN24_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN24 */
#define IFX_LMU_RGNACCEN_RA_EN24_OFF (24u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN25 */
#define IFX_LMU_RGNACCEN_RA_EN25_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN25 */
#define IFX_LMU_RGNACCEN_RA_EN25_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN25 */
#define IFX_LMU_RGNACCEN_RA_EN25_OFF (25u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN26 */
#define IFX_LMU_RGNACCEN_RA_EN26_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN26 */
#define IFX_LMU_RGNACCEN_RA_EN26_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN26 */
#define IFX_LMU_RGNACCEN_RA_EN26_OFF (26u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN27 */
#define IFX_LMU_RGNACCEN_RA_EN27_LEN (1u)

